oasdflkjo/stm32-demo/Core/Lib/L152RE/bsp_clk.c
/*
*********************************************************************************************************
*                                            EXAMPLE CODE
*
*               This file is provided as an example on how to use Micrium products.
*
*               Please feel free to use any application code labeled as 'EXAMPLE CODE' in
*               your application products.  Example code may be used as is, in whole or in
*               part, or may be used as a reference only. This file can be modified as
*               required to meet the end-product requirements.
*
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*
*               You can find our product's user manual, API reference, release notes and
*               more information at https://doc.micrium.com.
*               You can contact us at www.micrium.com.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                    MICRIUM BOARD SUPPORT PACKAGE
*                                         STM32L152RE NUCLEO
*
* Filename : bsp_clk.c
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                            INCLUDE FILES
*********************************************************************************************************
*/

#include  <lib_def.h>
#include  "bsp_clk.h"
#include  "stm32l1xx_hal.h"

#ifdef  CLK_MODULE_PRESENT
#include  <Source/clk.h>
#include  <clk_cfg.h>
#endif


/*
*********************************************************************************************************
*                                            LOCAL DEFINES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                      LOCAL FUNCTION PROTOTYPES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*********************************************************************************************************
*                                          GLOBAL FUNCTIONS
*********************************************************************************************************
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                            BSP_ClkInit()
*
* Description : Initializes the system clock for the kernel.
*
* Argument(s) : none.
*
* Return(s)   : none.
*
* Note(s)     : (1) Should be called before OSStart() in main.
*********************************************************************************************************
*/

void  BSP_ClkInit (void)
{
    RCC_ClkInitTypeDef  RCC_ClkInit;
    RCC_OscInitTypeDef  RCC_OscInit;


    RCC_OscInit.OscillatorType      = RCC_OSCILLATORTYPE_HSI;   /* HSI = internal 16MHz internal RC oscillator          */
    RCC_OscInit.HSIState            = RCC_HSI_ON;
    RCC_OscInit.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    RCC_OscInit.PLL.PLLState        = RCC_PLL_ON;
    RCC_OscInit.PLL.PLLSource       = RCC_PLLSOURCE_HSI;        /* PLLCLK = (HSI * PLLMUL) / PLLDIV = 32MHz (Max)       */
    RCC_OscInit.PLL.PLLMUL          = RCC_PLL_MUL6;
    RCC_OscInit.PLL.PLLDIV          = RCC_PLL_DIV3;
    if (HAL_RCC_OscConfig(&RCC_OscInit) != HAL_OK)
    {
        while(1u);                                              /* STOP if error                                        */
    }

    __HAL_RCC_PWR_CLK_ENABLE();                                 /* Set Voltage scale1 as MCU will run at 32MHz          */
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

                                                                /* Wait until Regulator is ready in the seleceted ...   */
    while (__HAL_PWR_GET_FLAG(PWR_FLAG_VOS) != RESET) {         /* ...voltage range.                                    */
        ;
    }

                                                                /* ----- CONFIGURE SYSCLK, HCLK, PCLK1 AND PCLK2 ------ */
    RCC_ClkInit.ClockType     = (RCC_CLOCKTYPE_SYSCLK  |
                                 RCC_CLOCKTYPE_HCLK    |
                                 RCC_CLOCKTYPE_PCLK1   |
                                 RCC_CLOCKTYPE_PCLK2);
    RCC_ClkInit.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;       /* SYSCLK  = PLLCLK = 32MHz                             */
    RCC_ClkInit.AHBCLKDivider  = RCC_SYSCLK_DIV1;               /* HCLK    = AHBCLK = PLLCLK / AHBPRES(1) = 32MHz.      */
    RCC_ClkInit.APB1CLKDivider = RCC_HCLK_DIV1;                 /* APB1CLK = AHBCLK / APB1DIV(1)          = 32MHz.      */
    RCC_ClkInit.APB2CLKDivider = RCC_HCLK_DIV1;                 /* APB2CLK = AHBCLK / APB2DIV(1)          = 32MHz.      */

    if (HAL_RCC_ClockConfig(&RCC_ClkInit, FLASH_LATENCY_1) != HAL_OK)
    {
        while(1u);                                              /* STOP if error                                        */
    }
}


/*
*********************************************************************************************************
*                                           BSP_ClkEnable()
*
* Description : Enables a specific peripheral clock.
*
* Argument(s) : clk_id    Clock identifier
*
* Return(s)   : none
*
* Note(s)     : none.
*********************************************************************************************************
*/

void  BSP_ClkEnable (BSP_CLK_ID  clk_id)
{

